services/service-httpbin/config.yml
---
config:
  extendedMetrics: true
  plugins:
    ensure: {}
    metrics-by-endpoint: {}
    expect: {}
    apdex: {}
  processor: ../scripts/helper-functions.js
  environments:
    int:
      target: https://httpbin.org
      http:
        timeout: 600
      phases:
        - name: Warm Up
          duration: 2
          arrivalRate: 1
          rampTo: 2
      variables:
        admin_username: "{{ $processEnvironment.ADMIN_USERNAME }}"
        admin_password: "{{ $processEnvironment.ADMIN_PASSWORD }}"
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: "{{$env.RESP_TIMENN}}"
      - http.response_time.p95: 1000
      - http.response_time.max: 2000
    maxErrorRate: 2